---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Assign(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
zh: 赋值、设置值、写入
source: html/02e6cf36-1d60-e6a7-b23e-e07224b7c133.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.Assign Method

**中文**: 赋值、设置值、写入

Assigns values of the source settings to this object.

## Syntax (C#)
```csharp
public void Assign(
	PointCloudColorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudColorSettings`) - The source settings.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null